# #Вывод фразы на экран
# print("Hello world") #sadfghnng
# print("Hello world")
# print("Hello world")
# print("MGTU Python.cod")

# x_int=7
# print(x_int)
# x_str="Hello"
# print(x_str)
# del x_int
# print(x_int)


print((12**2-10)/100)

x = 12
y = 45
x = x+y #12+45 = 57
x+=y #57+45 = 102
s = "helo world"
print("x =",x,"y =",y,"Hello world")
print("hello" in s)
x = 12
y = 12.0
z = x+y
print(z) #вывод
asd = int(input()) #ввод конкретно числа типа int
print(asd,sep = "asdfg")
# Пользователь вводит 2 числа. Надо вывести: сумму, 
# разность, произведение через символ ","

