#Пользователь вводит: сумма в рублях, курс доллара
#программа конвертирует валюту и выводит на экран

# num1 = int(input("input num1 -"))
# num2 = int(input("input num2 -"))

rub = int(input("Rub - "))
dol = float(input("Dollar - "))
print(rub/dol)